'''
name: 版本信息模块
author: NemesisZoo
description: 目前是报应系统的初版
'''

# 版本号
VERSION = 'v0.1'

FLAGLET = '''
 _   _                          _     ____            _
| \ | | ___ _ __ ___   ___  ___(_)___/ ___| _   _ ___| |_ ___ _ __ ___  
|  \| |/ _ \ '_ ` _ \ / _ \/ __| / __\___ \| | | / __| __/ _ \ '_ ` _ \ 
| |\  |  __/ | | | | |  __/\__ \ \__ \___) | |_| \__ \ ||  __/ | | | | |
|_| \_|\___|_| |_| |_|\___||___/_|___/____/ \__, |___/\__\___|_| |_| |_|
                                            |___/                       
    涅墨西斯系统
    '''

TOOLNAME = '代理IP采集工具'

usage = FLAGLET + '''
                                                    %s
''' % VERSION + '''                               ''' + TOOLNAME + '''

'''


def PrintLogo():
    print(usage)
